# Task 3_1

# m = int(input('Введите месяц в виде целого числа от 1 до 12: '))
# l1 = [12, 1, 2]
# l2 = [3, 4, 5]
# l3 = [6, 7, 8]
# l4 = [9, 10, 11]
#
# if m in l1:
#     print('Зима')
# elif m in l2:
#     print('Весна')
# elif m in l3:
#     print('Лето')
# elif m in l4:
#     print('Осень')
# else:
#     print('В году только 12 месяцев!')


# Task 3_2

month_list = {
    12: "Зима",
    1: "Зима",
    2: "Зима",
    3: "Весна",
    4: "Весна",
    5: "Весна",
    6: "Лето",
    7: "Лето",
    8: "Лето",
    9: "Осень",
    10: "Осень",
    11: "Осень",
}

m = int(input('Введите месяц в виде целого числа от 1 до 12: '))
if m in month_list:
    print(month_list[m])
else:
    print('В году только 12 месяцев!')
